funkBuild/esp_idf_timeseries/test_app/sdkconfig.defaults
# ESP IDF Timeseries Test Configuration
# Enables all features for comprehensive testing

# Target
CONFIG_IDF_TARGET="esp32s3"

# Series ID Cache Configuration
CONFIG_TIMESERIES_USE_SERIES_ID_CACHE=y
CONFIG_TIMESERIES_SERIES_ID_CACHE_SIZE=32
CONFIG_TIMESERIES_CACHE_USE_LRU=y
CONFIG_TIMESERIES_ENABLE_CACHE_STATS=y

# Chunk Buffer Configuration — reduced from 16 to 8 KiB for QEMU
# (no SPIRAM, tight internal heap)
CONFIG_TIMESERIES_CHUNK_BUFFER_SIZE=8

# Flash Configuration - 16MB for QEMU
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM disabled for QEMU
# CONFIG_SPIRAM is not set

# Heap tracing for memory leak detection
CONFIG_HEAP_TRACING_STANDALONE=y

# Unity test framework
CONFIG_UNITY_ENABLE_FLOAT=y
CONFIG_UNITY_ENABLE_DOUBLE=y
CONFIG_UNITY_ENABLE_64BIT=y
CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y

# Disable task watchdog during tests
CONFIG_ESP_TASK_WDT_EN=n

# Increase main task stack for test functions with deep call stacks
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Compiler Optimization - Use O2 for performance testing
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# ALP chunk size: lowered from 65535 to 200 so tests can exercise the chunking
# code path (series split across multiple ALP records) without needing 65535+
# data points per compaction run.
CONFIG_TIMESERIES_ALP_CHUNK_MAX_POINTS=200

# ---- Memory optimizations for QEMU (no SPIRAM, ~376 KiB internal RAM) ----
# Disable IRAM placement for non-essential functions to free DRAM.
# IRAM and DRAM share physical SRAM on ESP32-S3; less IRAM = more heap.
# CONFIG_ESP_HW_SUPPORT_FUNC_IN_IRAM is not set
# CONFIG_RTC_CLK_FUNC_IN_IRAM is not set
# CONFIG_RTC_TIME_FUNC_IN_IRAM is not set
# CONFIG_ESP_REGI2C_CTRL_FUNC_IN_IRAM is not set
# CONFIG_GDMA_ISR_HANDLER_IN_IRAM is not set
# CONFIG_GDMA_OBJ_DRAM_SAFE is not set
# CONFIG_ESP_ROM_PRINT_IN_IRAM is not set
# CONFIG_ESP_SYSTEM_IN_IRAM is not set
# CONFIG_ESP_TIMER_IN_IRAM is not set
# CONFIG_FREERTOS_IN_IRAM is not set
# CONFIG_LOG_IN_IRAM is not set
# CONFIG_LIBC_MISC_IN_IRAM is not set
# CONFIG_LIBC_LOCKS_PLACE_IN_IRAM is not set
